
## Plan Result

[CI link](https://github.com/takahiro-impara/pd-iac/actions/runs/8220163937)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * pagerduty_user.pd_user[&#34;imparapoc03@gmail.com&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # pagerduty_user.pd_user["imparapoc03@gmail.com"] will be created
  + resource "pagerduty_user" "pd_user" {
      + avatar_url      = (known after apply)
      + color           = (known after apply)
      + description     = "Managed by Terraform"
      + email           = "imparapoc03@gmail.com"
      + html_url        = (known after apply)
      + id              = (known after apply)
      + invitation_sent = (known after apply)
      + license         = (known after apply)
      + name            = "Poc User"
      + role            = "limited_user"
      + teams           = (known after apply)
      + time_zone       = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # pagerduty_user.pd_user["imparapoc03@gmail.com"] will be created%0A  + resource "pagerduty_user" "pd_user" {%0A      + avatar_url      = (known after apply)%0A      + color           = (known after apply)%0A      + description     = "Managed by Terraform"%0A      + email           = "imparapoc03@gmail.com"%0A      + html_url        = (known after apply)%0A      + id              = (known after apply)%0A      + invitation_sent = (known after apply)%0A      + license         = (known after apply)%0A      + name            = "Poc User"%0A      + role            = "limited_user"%0A      + teams           = (known after apply)%0A      + time_zone       = (known after apply)%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":1,"Program":"tfcmt","SHA1":"435df8444065b524fb9a102cfdb8b6bb561c9d63","Vars":{},"WorkflowName":"Plan"} -->